{
  "characters": [
    { "id": 1, "name": "Cuddles", "src": "/images/Cuddles.png", "comment": "Cuddles is one of the main characters of Happy Tree Friends, and is one of the main protagonists of the show, along with Giggles, Toothy, and Lumpy. He is considered the original Happy Tree Friends character and also the show's unofficial mascot. He's also a playable character in Deadeye Derby." },
    { "id": 2, "name": "Giggles", "src": "/images/Giggles.png", "comment": "Giggles is one of the main characters of Happy Tree Friends, and one of the four primary characters of the show, along with Cuddles, Toothy, and Lumpy. She is also a playable character in the False Alarm video game and also in Deadeye Derby." },
    { "id": 3, "name": "Toothy", "src": "/images/Toothy.png", "comment": "Toothy is one of the main characters of Happy Tree Friends, and one of the four primary characters of the show, along with Cuddles, Giggles, and Lumpy. He is also one of the playable characters in the False Alarm video game and Deadeye Derby." },
    { "id": 4, "name": "Lumpy", "src": "/images/Lumpy.png", "comment": "Lumpy is one of the main characters of Happy Tree Friends, and one of the four primary characters of the show, along with Cuddles, Giggles, and Toothy." },
    { "id": 5, "name": "Petunia", "src": "/images/Petunia.png", "comment": "This sweet smelling skunk never raises a stink! You won't have to hold your nose around this friendly creature. Petunia is one of the main characters of Happy Tree Friends." },
    { "id": 6, "name": "Handy", "src": "/images/Handy.png", "comment": "Handy is one of the main characters of Happy Tree Friends. He's also a premium character in Deadeye Derby." },
    { "id": 7, "name": "Nutty", "src": "/images/Nutty.png", "comment": "Nutty is one of the main characters of Happy Tree Friends and a playable character in the False Alarm video game and Deadeye Derby." },
    { "id": 8, "name": "Sniffles", "src": "/images/Sniffles.png", "comment": "Sniffles is one of the main characters of Happy Tree Friends. He's also a boss in Deadeye Derby." },
    { "id": 9, "name": "Pop", "src": "/images/Pop.png", "comment": "Pop is one of the main characters of Happy Tree Friends." },
    { "id": 10, "name": "Cub", "src": "/images/Cub.png", "comment": "Innocent and cute, Pop has his hands-full trying to keep this lil' tyke from crawling into trouble. Cub is one of the main characters of Happy Tree Friends." },
    { "id": 11, "name": "Flaky", "src": "/images/Flaky.png", "comment": "Flaky is one of the main characters of Happy Tree Friends and a playable character in the False Alarm video game and Deadeye Derby." },
    { "id": 12, "name": "The Mole", "src": "/images/TheMole.png", "comment": "The Mole (or simply just Mole in later episodes) is one of the main characters of Happy Tree Friends and one of the playable characters in the False Alarm video game." },
    { "id": 13, "name": "Disco Bear", "src": "/images/Disco.png", "comment": "Disco Bear is one of the main characters of Happy Tree Friends. He's also a premium character in Deadeye Derby." },
    { "id": 14, "name": "Russell", "src": "/images/Russell.png", "comment": "Russell (Originally Russell the Pirate) is one of the main characters of Happy Tree Friends, and one of the playable characters in the False Alarm video game, while also the third boss in Deadeye Derby." },
    { "id": 15, "name": "Lifty", "src": "/images/Lifty.png", "comment": "Lifty is one of the main characters of Happy Tree Friends. He's also a boss in Deadeye Derby, along with Shifty, both together making a singular boss." },
    { "id": 16, "name": "Mime", "src": "/images/Mime.png", "comment": "Mime is one of the main characters of Happy Tree Friends." },
    { "id": 17, "name": "Cro-Marmot", "src": "/images/Cro-Marmot.png", "comment": "Cro-Marmot is one of the main characters of Happy Tree Friends." },
    { "id": 18, "name": "Splendid", "src": "/images/Splendid.png", "comment": "Splendid (Originally listed as Splendid The Flying Squirrel) is one of the main characters of Happy Tree Friends, and its spin-off series, Ka-Pow! He is also a premium character in Deadeye Derby." },
    { "id": 19, "name": "Lammy", "src": "/images/Lammy.png", "comment": "Lammy is one of the main characters of the Happy Tree Friends series. She does not appear in the TV series, as she made her debut appearance in 2010, whereas the TV series aired (and ended) in 2006." },
    { "id": 20, "name": "Mr. Pickels", "src": "/images/Mrpickels.png", "comment": "Mr. Pickels is the secondary antagonist of Happy Tree Friends, and one of the two regularly antagonistic main characters in the show (along with Fliqpy). He is a pickle and the only non-animal main character in the show. He does not appear in the TV series, as he debuted in 2010, whereas the TV series aired (and ended) in 2006." },
    { "id": 21, "name": "Shifty", "src": "/images/Shifty.png", "comment": "Shifty is one of the main characters of Happy Tree Friends. He's also a boss in Deadeye Derby, along with Lifty, both together making an individual boss." },
    { "id": 22, "name": "Fliqpy", "src": "/images/Fliqpy.png", "comment": "Fliqpy is the main antagonist of Happy Tree Friends, and one of the two regularly antagonistic main characters in the show (along with Mr. Pickels) and the split personality of Flippy." },
    { "id": 23, "name": "Flippy", "src": "/images/Flippy.png", "comment": "Flippy is one of the main characters in Happy Tree Friends, its spin-off series Ka-Pow!, and the video game False Alarm, where he is a playable character. He also serves as the final boss in Deadeye Derby." }
  ]
}
